# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

flag = True
while flag:
    num = input('Введите число: ')
    if num.isdigit():
        flag = False
        num = int(num)
    else:
        print('Введено некорректное значение! Попробуйте еще раз!')

print(f'{num} -> {(str(bin(num)))[2:]}')  # Решил через конвертацию типа и строку, можно было математическим путём,
                                          # надеюсь, что так можно было :)
